Мобилка_серверная/src/DataProcessors/ОбработкаКонтактов/ОбработкаКонтактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаКонтактов</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прозвище</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заметка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Мобилка_серверная/src/DataProcessors/ОбработкаКонтактов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПокаказатьДопИмена(Команда)
	Элементы.ГруппаОсновныеДанные.Видимость = НЕ Элементы.ГруппаОсновныеДанные.Видимость;
	Элементы.ПокаказатьДопИмена.Картинка = ?(Элементы.ГруппаОсновныеДанные.Видимость, БиблиотекаКартинок.Свернуть, БиблиотекаКартинок.Развернуть);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтакт(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		ДанныеКонтакта = Новый ДанныеКонтакта;
		ЗаполнитьКонтакты(ДанныеКонтакта);
		
		
		МК = Новый МенеджерКонтактов;
		
		НовыйКонтакт = Новый ДанныеКонтактаУчетнойЗаписи(ДанныеКонтакта, МК.ПолучитьЛокальнуюУчетнуюЗаписьКонтактов()); 
		МК.ДобавитьКонтакт(НовыйКонтакт);
		Сообщить("Контакт успешно добавлен!");
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтакты(ДанныеКонтакта)
	#Если МобильноеПриложениеСервер Тогда
		
		Для каждого Стр Из Метаданные.Обработки.ОбработкаКонтактов.Реквизиты Цикл
			Если НЕ ЗначениеЗаполнено(Объект[Стр.Имя]) Тогда Продолжить КонецЕсли; 
			ДанныеКонтакта[Стр.Имя] = Объект[Стр.Имя];
		КонецЦикла;
		ДанныеКонтакта.НомераТелефонов = ПолучитьМассивДанных("ГруппаТелефоны","Строка",ТипНомераТелефонаДанныхКонтакта);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяПриИзменении(Элемент)
	ПолноеИмя = СокрЛП(ПолноеИмя);
	МнСтр=СтрЗаменить(ПолноеИмя," ",Символы.ПС);
	Массив = Новый Массив;
	Для Индекс=1 По СтрЧислоСтрок(МнСтр) Цикл
		Стр = СтрПолучитьСтроку(МнСтр,Индекс);
		Если Не ЗначениеЗаполнено(Стр) Тогда Продолжить КонецЕсли; 
		Массив.Добавить(Стр);
	КонецЦикла;
	Если Массив.Количество() = 0 ИЛИ Массив.Количество() = 1 Тогда
		Объект.Имя = ПолноеИмя;
	ИначеЕсли Массив.Количество() = 2 Тогда
		Объект.Имя = Массив[0];
		Объект.Отчество = Массив[1];
	Иначе
		Объект.Имя = "";
		Для Индекс = 0 По Массив.Количество() - 3 Цикл
			Объект.Имя = Объект.Имя + " " + Массив[Индекс];
		КонецЦикла; 
		Объект.Отчество = Массив[Массив.Количество() - 2];
		Объект.Фамилия = Массив[Массив.Количество() - 1];
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДопНаименованияПриИзменении(Элемент)
	ПолноеИмя = Объект.Имя + " " + Объект.Отчество + " " + Объект.Фамилия;
	ПолноеИмя = СокрЛП(ПолноеИмя);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОрганизацию(Команда)
	Элементы.ДобавитьОрганизацию.Пометка = НЕ Элементы.ДобавитьОрганизацию.Пометка;
	Элементы.ДобавитьОрганизацию.Картинка = ?(Элементы.ДобавитьОрганизацию.Пометка, БиблиотекаКартинок.УдалитьЭлементСписка, БиблиотекаКартинок.ДобавитьЭлементСписка);
	Элементы.ГруппаОрганизация.Видимость = Элементы.ДобавитьОрганизацию.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГруппу(Команда)
	Если Найти(Команда.Имя, "Телефон") Тогда
		ОтобразитьЭлементы("ГруппаТелефоны","УдалитьТелефон","ДобавитьТелефон","Строка");
	ИначеЕсли Найти(Команда.Имя, "Почту") Тогда
		ОтобразитьЭлементы("АдресПочты","УдалитьПочту","ДобавитьПочту","СтрокаПочты");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЭлементы(ВерхняяГруппа, КнопкаУдаления, КнопкаДобавления, ИмяГруппы)
	Видимость = 0;
	Добавлен = Ложь;
	Для каждого Эл Из Элементы[ВерхняяГруппа].ПодчиненныеЭлементы Цикл
		Если НЕ Найти(Эл.Имя,ИмяГруппы) Тогда Продолжить	КонецЕсли; 
		Если НЕ Эл.Видимость И НЕ Добавлен Тогда
			Добавлен = Истина;
			Эл.Видимость = Истина;
		КонецЕсли; 
		Видимость = Видимость + Эл.Видимость;
	КонецЦикла; 
	Для каждого Эл Из Элементы[ВерхняяГруппа].ПодчиненныеЭлементы Цикл
		Если НЕ Найти(Эл.Имя,ИмяГруппы) Тогда Продолжить	КонецЕсли; 
		Кнопка = Эл.ПодчиненныеЭлементы.Найти(КнопкаУдаления + СтрЗаменить(Эл.Имя,ИмяГруппы,""));		
		Кнопка.Видимость = Эл.Видимость И Видимость;		
	КонецЦикла;
	Элементы[КнопкаДобавления].Видимость = ?(Видимость = 5, Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьГруппы(Команда)
	Если Найти(Команда.Имя, "Телефон") Тогда
		СкрытьЭлементы(Команда.Имя, "ГруппаТелефоны","УдалитьТелефон","ДобавитьТелефон","Строка");
	ИначеЕсли Найти(Команда.Имя, "Почту") Тогда
		СкрытьЭлементы(Команда.Имя, "АдресПочты","УдалитьПочту","ДобавитьПочту","СтрокаПочты");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СкрытьЭлементы(ИмяКоманды, ВерхняяГруппа, КнопкаУдаления, КнопкаДобавления,ИмяГруппы)
	
	ГруппаСтр = Элементы.Найти(ИмяКоманды).Родитель;
	ГруппаСтр.Видимость = Ложь;	
	Элементы[КнопкаДобавления].Видимость = Истина;
	
	Видимость = 0;
	Для каждого Эл Из Элементы[ВерхняяГруппа].ПодчиненныеЭлементы Цикл
		Если НЕ Найти(Эл.Имя,ИмяГруппы) Тогда Продолжить	КонецЕсли; 
		Видимость = Видимость + Эл.Видимость;
	КонецЦикла;
	Если Видимость = 1 Тогда
		Для каждого Эл Из Элементы[ВерхняяГруппа].ПодчиненныеЭлементы Цикл
			Если НЕ Найти(Эл.Имя,ИмяГруппы) Тогда Продолжить	КонецЕсли; 
			Если Эл.Видимость Тогда
				Кнопка = Эл.ПодчиненныеЭлементы.Найти(КнопкаУдаления + СтрЗаменить(Эл.Имя,ИмяГруппы,""));		
				Кнопка.Видимость = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДанных(ВерхняяГруппа,ИмяГруппы, ТипДанныхОбъекта)
	#Если МобильноеПриложениеСервер Тогда
		Массив = Новый Массив;
		Для каждого Эл Из Элементы[ВерхняяГруппа].ПодчиненныеЭлементы Цикл
			Если НЕ Найти(Эл.Имя,ИмяГруппы) Тогда Продолжить КонецЕсли; 
			Если НЕ Эл.Видимость 			Тогда Продолжить КонецЕсли; 
			Значение  = ЭтаФорма[Эл.ПодчиненныеЭлементы[0].Имя];
			ТипДанных = ЭтаФорма[Эл.ПодчиненныеЭлементы[1].Имя];
			
			Если НЕ ЗначениеЗаполнено(Значение) ИЛИ НЕ ЗначениеЗаполнено(ТипДанных) Тогда Продолжить КонецЕсли; 
			ОписаниеКонтакта = Новый ЭлементДанныхКонтакта(ТипДанныхОбъекта[ТипДанных], Значение);
			Массив.Добавить(ОписаниеКонтакта);
			
		КонецЦикла; 
		
		Возврат Массив;
	#КонецЕсли
КонецФункции
